OpenFOAM-6-cantera-openmpi/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/bubbleColumnPolydisperse/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    zone;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
           boxes
           (
                (0 0.4 0) (0.15 0.5 0.1)
           );
        }
    }

    {
        name    zone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
           set  zone;
        }
    }
);

// ************************************************************************* //
